#


# https://dev-yakuza.posstree.com/environment/configure-development-environment-on-mac-with-homebrew-and-shell-script/#homebrew%E3%81%A8brewfile%E3%81%AE%E3%82%A4%E3%83%B3%E3%82%B9%E3%83%88%E3%83%BC%E3%83%AB


# apps
brew "mas"
brew "anaconda3"
brew "emacs"
brew "gnuplot"


# commands
brew "inetutils"
brew "imagemagick"
brew "sqlite"


# gnu command replace
# https://qiita.com/eumesy/items/3bb39fc783c8d4863c5f
brew "coreutils --default-names"
brew "diffutils"
brew "findutils"
brew "ed"
brew "gawk"
brew "gsed"
brew "gnu-tar"
brew "grep"
brew "gzip"



# cask
cask "zoom"
cask "google-chrome"
cask "iterm2"
cask "alfread"
cask "notion"
cask "keepassXC"
cask "things"
cask "visual-studio-code"
cask "iterm2"
cask "zotero"
cask "slack"
cask "skim"
cask "alfred"
cask "deepl"
cask "dropbox"
cask "grammarly"





