#


# https://dev-yakuza.posstree.com/environment/configure-development-environment-on-mac-with-homebrew-and-shell-script/#homebrew%E3%81%A8brewfile%E3%81%AE%E3%82%A4%E3%83%B3%E3%82%B9%E3%83%88%E3%83%BC%E3%83%AB


# apps
brew "mas"
brew "emacs"
brew "gnuplot"


# commands
brew "inetutils"
brew "imagemagick"
brew "sqlite"
brew "hub"     #githubの上級コマンド

# update command
brew "bash"    #ブレース展開にbash4以上が必要．

# gnu command replace
# https://qiita.com/eumesy/items/3bb39fc783c8d4863c5f
# https://yu8mada.com/2018/07/25/install-gnu-commands-on-macos-with-homebrew/
#brew "coreutils --default-names"
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "ed"
brew "gawk"
brew "gsed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "gnutls"
brew "wdiff"
brew "wget"
brew "gnu-which"

# other highlevel command replace
brew "ccat" # replace cat
brew "grc"  # ping, etc..
brew "colordiff" # replace diff
brew "source-hihlight" # replace less



# cask font
cask "font-hack-nerd-font"
cask "font-menlo-for-powerline"


# cask
# cask "anaconda" 現在M1macに非対応
cask "google-chrome"
cask "iterm2"
cask "alfred"
cask "notion"
cask "keepassXC"
cask "things"
cask "visual-studio-code"
cask "iterm2"
cask "zotero"
cask "slack"
cask "line"
cask "skim"
cask "alfred"
cask "deepl"
cask "dropbox"
cask "grammarly"
cask "background-music" #現在M1macに非対応
cask "itsycal"
cask "google-drive" #passwordが必須
cask "zoom"  #passwordを要求された．どうも自動で起動したっぽくて，今後改善が必要．

# cask for Lab
cask "apachedirectorystudio"
cask "nextcloud"


# appstore
mas "Things 3", id: 904280696
mas "WeatherBug", id: 1059074180


# after things3 install
cask "thingsmacsandboxhelper"
